grevaillot/svd_tools/headers/STM32H7x7_CM4/adc1_2.h
#define ADC1_2_SMPR2_SMP19_SHIFT		27
#define ADC1_2_SMPR2_SMP19_MASK		0x07
/** @defgroup adc1_2_smpr2_smp19 SMP19 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP18_SHIFT		24
#define ADC1_2_SMPR2_SMP18_MASK		0x07
/** @defgroup adc1_2_smpr2_smp18 SMP18 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP17_SHIFT		21
#define ADC1_2_SMPR2_SMP17_MASK		0x07
/** @defgroup adc1_2_smpr2_smp17 SMP17 ADC channel 17 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP16_SHIFT		18
#define ADC1_2_SMPR2_SMP16_MASK		0x07
/** @defgroup adc1_2_smpr2_smp16 SMP16 ADC channel 16 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP15_SHIFT		15
#define ADC1_2_SMPR2_SMP15_MASK		0x07
/** @defgroup adc1_2_smpr2_smp15 SMP15 ADC channel 15 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP14_SHIFT		12
#define ADC1_2_SMPR2_SMP14_MASK		0x07
/** @defgroup adc1_2_smpr2_smp14 SMP14 ADC channel 14 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP13_SHIFT		9
#define ADC1_2_SMPR2_SMP13_MASK		0x07
/** @defgroup adc1_2_smpr2_smp13 SMP13 ADC channel 13 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP12_SHIFT		6
#define ADC1_2_SMPR2_SMP12_MASK		0x07
/** @defgroup adc1_2_smpr2_smp12 SMP12 ADC channel 12 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP11_SHIFT		3
#define ADC1_2_SMPR2_SMP11_MASK		0x07
/** @defgroup adc1_2_smpr2_smp11 SMP11 ADC channel 11 sampling time selection
@{*/
/**@}*/


#define ADC1_2_SMPR2_SMP10_SHIFT		0
#define ADC1_2_SMPR2_SMP10_MASK		0x07
/** @defgroup adc1_2_smpr2_smp10 SMP10 ADC channel 10 sampling time selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_pcsel PCSEL ADC pre channel selection register
@{*/


#define ADC1_2_PCSEL_PCSEL_SHIFT		0
#define ADC1_2_PCSEL_PCSEL_MASK		0xfffff
/** @defgroup adc1_2_pcsel_pcsel PCSEL Channel x (VINP[i]) pre selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_ltr1 LTR1 ADC analog watchdog 1 threshold register
@{*/


#define ADC1_2_LTR1_LTR1_SHIFT		0
#define ADC1_2_LTR1_LTR1_MASK		0x3ffffff
/** @defgroup adc1_2_ltr1_ltr1 LTR1 ADC analog watchdog 1 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_lhtr1 LHTR1 ADC analog watchdog 2 threshold register
@{*/


#define ADC1_2_LHTR1_LHTR1_SHIFT		0
#define ADC1_2_LHTR1_LHTR1_MASK		0x3ffffff
/** @defgroup adc1_2_lhtr1_lhtr1 LHTR1 ADC analog watchdog 2 threshold low
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_sqr1 SQR1 ADC group regular sequencer ranks register 1
@{*/


#define ADC1_2_SQR1_SQ4_SHIFT		24
#define ADC1_2_SQR1_SQ4_MASK		0x1f
/** @defgroup adc1_2_sqr1_sq4 SQ4 ADC group regular sequencer rank 4
@{*/
/**@}*/


#define ADC1_2_SQR1_SQ3_SHIFT		18
#define ADC1_2_SQR1_SQ3_MASK		0x1f
/** @defgroup adc1_2_sqr1_sq3 SQ3 ADC group regular sequencer rank 3
@{*/
/**@}*/


#define ADC1_2_SQR1_SQ2_SHIFT		12
#define ADC1_2_SQR1_SQ2_MASK		0x1f
/** @defgroup adc1_2_sqr1_sq2 SQ2 ADC group regular sequencer rank 2
@{*/
/**@}*/


#define ADC1_2_SQR1_SQ1_SHIFT		6
#define ADC1_2_SQR1_SQ1_MASK		0x1f
/** @defgroup adc1_2_sqr1_sq1 SQ1 ADC group regular sequencer rank 1
@{*/
/**@}*/


#define ADC1_2_SQR1_L3_SHIFT		0
#define ADC1_2_SQR1_L3_MASK		0x0f
/** @defgroup adc1_2_sqr1_l3 L3 L3
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_sqr2 SQR2 ADC group regular sequencer ranks register 2
@{*/


#define ADC1_2_SQR2_SQ9_SHIFT		24
#define ADC1_2_SQR2_SQ9_MASK		0x1f
/** @defgroup adc1_2_sqr2_sq9 SQ9 ADC group regular sequencer rank 9
@{*/
/**@}*/


#define ADC1_2_SQR2_SQ8_SHIFT		18
#define ADC1_2_SQR2_SQ8_MASK		0x1f
/** @defgroup adc1_2_sqr2_sq8 SQ8 ADC group regular sequencer rank 8
@{*/
/**@}*/


#define ADC1_2_SQR2_SQ7_SHIFT		12
#define ADC1_2_SQR2_SQ7_MASK		0x1f
/** @defgroup adc1_2_sqr2_sq7 SQ7 ADC group regular sequencer rank 7
@{*/
/**@}*/


#define ADC1_2_SQR2_SQ6_SHIFT		6
#define ADC1_2_SQR2_SQ6_MASK		0x1f
/** @defgroup adc1_2_sqr2_sq6 SQ6 ADC group regular sequencer rank 6
@{*/
/**@}*/


#define ADC1_2_SQR2_SQ5_SHIFT		0
#define ADC1_2_SQR2_SQ5_MASK		0x1f
/** @defgroup adc1_2_sqr2_sq5 SQ5 ADC group regular sequencer rank 5
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_2_sqr3 SQR3 ADC group regular sequencer ranks register 3
@{*/

/** ADC1_2_SQR3_ADCAL ADC calibration **/
#define ADC1_2_SQR3_ADCAL		(1 << 31)
/** ADC1_2_SQR3_ADCALDIF ADC differential mode for calibration **/
#define ADC1_2_SQR3_ADCALDIF		(1 << 30)
/** ADC1_2_SQR3_DEEPPWD ADC deep power down enable **/
#define ADC1_2_SQR3_DEEPPWD		(1 << 29)
/** ADC1_2_SQR3_ADVREGEN ADC voltage regulator enable **/
#define ADC1_2_SQR3_ADVREGEN		(1 << 28)
/** ADC1_2_SQR3_LINCALRDYW6 Linearity calibration ready Word 6 **/
#define ADC1_2_SQR3_LINCALRDYW6		(1 << 27)
/** ADC1_2_SQR3_LINCALRDYW5 Linearity calibration ready Word 5 **/
#define ADC1_2_SQR3_LINCALRDYW5		(1 << 26)
/** ADC1_2_SQR3_LINCALRDYW4 Linearity calibration ready Word 4 **/
#define ADC1_2_SQR3_LINCALRDYW4		(1 << 25)
/** ADC1_2_SQR3_LINCALRDYW3 Linearity calibration ready Word 3 **/
#define ADC1_2_SQR3_LINCALRDYW3		(1 << 24)
/** ADC1_2_SQR3_LINCALRDYW2 Linearity calibration ready Word 2 **/
#define ADC1_2_SQR3_LINCALRDYW2		(1 << 23)
/** ADC1_2_SQR3_LINCALRDYW1 Linearity calibration ready Word 1 **/
#define ADC1_2_SQR3_LINCALRDYW1		(1 << 22)
/** ADC1_2_SQR3_ADCALLIN Linearity calibration **/
#define ADC1_2_SQR3_ADCALLIN		(1 << 16)

#define ADC1_2_SQR3_BOOST_SHIFT		8
#define ADC1_2_SQR3_BOOST_MASK		0x03
/** @defgroup adc1_2_sqr3_boost BOOST Boost mode control
@{*/
/**@}*/

/** ADC1_2_SQR3_JADSTP ADC group injected conversion stop **/
#define ADC1_2_SQR3_JADSTP		(1 << 5)
/** ADC1_2_SQR3_ADSTP ADC group regular conversion stop **/
#define ADC1_2_SQR3_ADSTP		(1 << 4)
/** ADC1_2_SQR3_JADSTART ADC group injected conversion start **/
#define ADC1_2_SQR3_JADSTART		(1 << 3)
/** ADC1_2_SQR3_ADSTART ADC group regular conversion start **/
#define ADC1_2_SQR3_ADSTART		(1 << 2)
/** ADC1_2_SQR3_ADDIS ADC disable **/
#define ADC1_2_SQR3_ADDIS		(1 << 1)
/** ADC1_2_SQR3_ADEN ADC enable **/
#define ADC1_2_SQR3_ADEN		(1 << 0)

/**@}*/

